app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "realese", "actor", "direrctor", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "abc"], ["realese", "03/23/2015"], ["actor", "xyz"], ["direrctor", "lmn"], ["rating", "3"], ["created_at", "2015-03-26 09:13:05.798052"], ["updated_at", "2015-03-26 09:13:05.798052"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save